---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelConduits
source: html/6e3bfe2b-f8b1-3f49-3257-5ebf1c79427a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelConduits Property

Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughRoomForParallelConduits { get; }
```